app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" LIMIT ? OFFSET ?  [["LIMIT", 26], ["OFFSET", 0]]
SELECT "tutors".* FROM "tutors" WHERE "tutors"."course_id" IN (?, ?, ?)  [["course_id", 1], ["course_id", 2], ["course_id", 3]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "courses" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 2], ["OFFSET", 0]]
---
  def index
    paginate json: Course.includes(:tutors).as_json(include: :tutors), links: {}

INSERT INTO "courses" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "FInal Test3"], ["created_at", "2021-07-26 05:53:50.249091"], ["updated_at", "2021-07-26 05:53:50.249091"]]
---
  def create
    @course  = Course.new(course_params)
    if @course.save!